<?php
// طاها صحتی
$x = 10 ;
$y = 15;
echo $x;
echo $y;
//--------------------------
$x = 10 ;
$y = 15 ;
echo $x *$y ;

$x = 10 ;
$y = 15 ;
echo $x -$y ;

$x = 10 ;
$y = 15 ;
echo $x +$y ;

$x = 10 ;
$y = 15 ;
echo $x /$y ;
//--------------------------
$x = 10 ;
$y = 15;
var_dump( $x == $y);

$x = 15 ;
$y = 15.0;
var_dump( $x === $y);

$x = 10 ;
$y = 15;
var_dump( $x >= $y);

$x = 10 ;
$y = 15;
var_dump( $x != $y);

//--------------------------
$x = 10 ;
$y = 15;
$x += $y ;
echo $x ;

$x = 10 ;
$y = 15 ;
$x %= $y ;
echo $x ;

$x = 10 ;
$y = 15;
$x *= $y ;
echo $x ;
//--------------------------
$x = ( 10 == 15 ) ? "YES" : "NO" ;
echo $x ;
//--------------------------
$x = array("taha", "sehati", "1386", "07772829294");
var_dump($x);
//--------------------------
$x = 10 ;
echo $x++ ;
echo $x ;

$x = 10 ;
echo ++$x ;
echo $x ;

$x = 10 ;
echo --$x ;
echo $x ;

//--------------------------

$x = 10 ;
$y = 20 ;
$z = 30 ;
var_dump( $x > $y or $z > $y);


var_dump( $z == $x and $y > $x);